<a href="https://colab.research.google.com/github/June103310110/itri_ml_course/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')

In [5]:
df.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

1. 學習採樣出第500~600筆資料
> hint: df.loc
2. 採樣出所有資料的性別、年齡和是否生存、Embarked 四個欄位作為新dataframe並找出各欄位的mode, mean以及畫出圖表(hist, scatter)
3. 對embarked欄位做onehot encode
> hint: sklearn onehotEncoder or pd get_dummies
### 重新取得原始資料，並依序做以下事項
4. 補缺失值
5. 對所有需要轉換的欄位做onehot or label Encode
6. 丟到決策樹進行訓練 (sklearn)
7. 評估acc
8. 丟到隨機森林 or XGB 進行訓練 (sklearn)
9. 評估acc

In [7]:

len(df)

891